{
  "ir_version": "4.0",
  "goal": "Extract invoices and receipts from unread Gmail emails, store files in Google Drive, log transactions over $50 to Google Sheets, and send summary email",
  "execution_graph": {
    "start": "node_0",
    "nodes": {
      "node_0": {
        "id": "node_0",
        "type": "operation",
        "operation": {
          "operation_type": "fetch",
          "fetch": {
            "plugin_key": "google-mail",
            "action": "search_emails",
            "config": {
              "query": "is:unread has:attachment",
              "read_status": false,
              "has_attachments": true,
              "include_attachments": true
            }
          },
          "description": "Fetch unread emails from Gmail"
        },
        "outputs": [
          {
            "variable": "unread_emails"
          }
        ],
        "next": "node_1"
      },
      "node_1": {
        "id": "node_1",
        "type": "operation",
        "operation": {
          "operation_type": "deliver",
          "deliver": {
            "plugin_key": "google-drive",
            "action": "get_or_create_folder",
            "config": {}
          },
          "description": "Create Google Drive folder for storing invoice/receipt files"
        },
        "outputs": [
          {
            "variable": "drive_folder"
          }
        ],
        "next": "node_2"
      },
      "node_2": {
        "id": "node_2",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "flatten",
            "input": "unread_emails",
            "custom_code": "Flatten email attachments into individual items, filtering for PDF and image types, and enriching with email metadata (sender, subject)"
          },
          "description": "Extract PDF and image attachments from emails with metadata"
        },
        "outputs": [
          {
            "variable": "candidate_attachments"
          }
        ],
        "next": "node_3"
      },
      "node_4": {
        "id": "node_4",
        "type": "operation",
        "operation": {
          "operation_type": "deliver",
          "deliver": {
            "plugin_key": "google-drive",
            "action": "upload_file",
            "config": {
              "data": "attachment",
              "file_name": "attachment.filename",
              "destination": "drive_folder"
            }
          },
          "description": "Upload attachment file to Google Drive folder"
        },
        "outputs": [
          {
            "variable": "uploaded_file"
          }
        ],
        "next": "node_5"
      },
      "node_5": {
        "id": "node_5",
        "type": "operation",
        "operation": {
          "operation_type": "deliver",
          "deliver": {
            "plugin_key": "document-extractor",
            "action": "extract_structured_data",
            "config": {
              "input": "uploaded_file",
              "fields": [
                {
                  "name": "date",
                  "type": "date",
                  "required": false
                },
                {
                  "name": "vendor",
                  "type": "string",
                  "required": false
                },
                {
                  "name": "amount",
                  "type": "number",
                  "required": true
                },
                {
                  "name": "currency",
                  "type": "string",
                  "required": false
                },
                {
                  "name": "invoice_number",
                  "type": "string",
                  "required": false
                }
              ]
            }
          },
          "description": "Extract structured transaction fields from attachment"
        },
        "outputs": [
          {
            "variable": "extracted_fields"
          }
        ],
        "next": "node_6"
      },
      "node_7": {
        "id": "node_7",
        "type": "end",
        "description": "Merge point after conditional check_amount_extracted"
      },
      "node_8": {
        "id": "node_8",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "map",
            "input": "extracted_fields",
            "custom_code": "Combine extracted fields with file metadata and email source info"
          },
          "description": "Build complete transaction record with all metadata"
        },
        "outputs": [
          {
            "variable": "transaction_record"
          }
        ],
        "next": "node_7"
      },
      "node_9": {
        "id": "node_9",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "custom",
            "input": "extracted_fields",
            "custom_code": "Return null/empty record"
          },
          "description": "Skip transaction record creation (no amount found)"
        },
        "outputs": [
          {
            "variable": "transaction_record"
          }
        ],
        "next": "node_7"
      },
      "node_6": {
        "id": "node_6",
        "type": "choice",
        "choice": {
          "rules": [
            {
              "condition": {
                "type": "simple",
                "variable": "extracted_fields.amount",
                "operator": "exists"
              },
              "next": "node_8"
            }
          ],
          "default": "node_9"
        }
      },
      "node_3": {
        "id": "node_3",
        "type": "loop",
        "loop": {
          "iterate_over": "candidate_attachments",
          "item_variable": "attachment",
          "body_start": "node_4",
          "collect_outputs": true,
          "output_variable": "processed_transactions"
        },
        "next": "node_10"
      },
      "node_10": {
        "id": "node_10",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "filter",
            "input": "processed_transactions",
            "custom_code": "Remove null/empty transaction records where amount extraction failed",
            "output_schema": {
              "type": "array",
              "items": {
                "type": "object",
                "properties": {
                  "amount": {
                    "type": "string"
                  }
                },
                "required": []
              }
            }
          },
          "description": "Filter out transactions without valid amounts"
        },
        "outputs": [
          {
            "variable": "valid_transactions"
          }
        ],
        "next": "node_11"
      },
      "node_11": {
        "id": "node_11",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "filter",
            "input": "valid_transactions",
            "filter_expression": {
              "type": "simple",
              "variable": "valid_transactions.amount",
              "operator": "gt",
              "value": "{{config.amount_threshold_usd}}"
            }
          },
          "description": "Filter subset for high_value_transactions"
        },
        "outputs": [
          {
            "variable": "high_value_transactions"
          }
        ],
        "next": "node_12"
      },
      "node_12": {
        "id": "node_12",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "filter",
            "input": "valid_transactions",
            "filter_expression": {
              "type": "simple",
              "variable": "valid_transactions.amount",
              "operator": "lte",
              "value": "{{config.amount_threshold_usd}}"
            }
          },
          "description": "Filter subset for low_value_transactions"
        },
        "outputs": [
          {
            "variable": "low_value_transactions"
          }
        ],
        "next": "node_13"
      },
      "node_13": {
        "id": "node_13",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "reduce",
            "input": "valid_transactions",
            "reduce_operation": "count"
          },
          "description": "Count items for total_count"
        },
        "outputs": [
          {
            "variable": "total_count"
          }
        ],
        "next": "node_14"
      },
      "node_14": {
        "id": "node_14",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "reduce",
            "input": "valid_transactions",
            "reduce_operation": "sum",
            "custom_code": "field:amount"
          },
          "description": "Aggregate sum for total_amount"
        },
        "outputs": [
          {
            "variable": "total_amount"
          }
        ],
        "next": "node_15"
      },
      "node_15": {
        "id": "node_15",
        "type": "operation",
        "operation": {
          "operation_type": "deliver",
          "deliver": {
            "plugin_key": "google-sheets",
            "action": "read_range",
            "config": {
              "spreadsheet_id": "{{config.google_sheet_id}}",
              "tab_name": "{{config.sheet_tab_name}}"
            }
          },
          "description": "Reference existing Google Sheets spreadsheet"
        },
        "outputs": [
          {
            "variable": "expense_sheet"
          }
        ],
        "next": "node_16"
      },
      "node_17": {
        "id": "node_17",
        "type": "operation",
        "operation": {
          "operation_type": "deliver",
          "deliver": {
            "plugin_key": "google-sheets",
            "action": "append_rows",
            "config": {
              "data": "transaction",
              "fields": {
                "Date": "transaction.date",
                "Vendor": "transaction.vendor",
                "Amount": "transaction.amount",
                "Currency": "transaction.currency",
                "Invoice Number": "transaction.invoice_number",
                "Drive Link": "transaction.drive_link",
                "Email Sender": "transaction.email_sender",
                "Email Subject": "transaction.email_subject"
              },
              "destination": "expense_sheet",
              "spreadsheet_id": "{{config.google_sheet_id}}",
              "tab_name": "{{config.sheet_tab_name}}"
            }
          },
          "description": "Append transaction row to Google Sheets"
        },
        "outputs": [
          {
            "variable": "append_transaction_row_result"
          }
        ]
      },
      "node_16": {
        "id": "node_16",
        "type": "loop",
        "loop": {
          "iterate_over": "high_value_transactions",
          "item_variable": "transaction",
          "body_start": "node_17",
          "collect_outputs": false
        },
        "next": "node_18"
      },
      "node_18": {
        "id": "node_18",
        "type": "operation",
        "operation": {
          "operation_type": "ai",
          "ai": {
            "type": "generate",
            "instruction": "Create an email-friendly HTML summary with: 1) A table of ALL extracted transactions with columns for date, vendor, amount, currency, invoice number, Drive link, email sender, and email subject. 2) A separate section listing only transactions with amount > $50. 3) A totals summary showing total number of transactions and sum of all amounts. Include proper HTML formatting with tables.",
            "output_schema": {
              "type": "object",
              "properties": {
                "subject": {
                  "type": "string",
                  "description": "Email subject line"
                },
                "body": {
                  "type": "string",
                  "description": "HTML email body with tables and summary"
                }
              },
              "required": [
                "subject",
                "body"
              ]
            }
          },
          "description": "Generate email summary with transaction tables and totals"
        },
        "outputs": [
          {
            "variable": "summary_email_content"
          }
        ],
        "inputs": [
          {
            "variable": "valid_transactions"
          },
          {
            "variable": "high_value_transactions"
          },
          {
            "variable": "low_value_transactions"
          }
        ],
        "next": "node_19"
      },
      "node_19": {
        "id": "node_19",
        "type": "operation",
        "operation": {
          "operation_type": "deliver",
          "deliver": {
            "plugin_key": "google-mail",
            "action": "send_email",
            "config": {
              "recipients": {
                "to": [
                  "{{config.user_email}}"
                ]
              },
              "content": {
                "subject": "summary_email_content.subject",
                "html_body": "summary_email_content.body"
              }
            }
          },
          "description": "Send summary email to user"
        },
        "next": "node_end"
      },
      "node_end": {
        "id": "node_end",
        "type": "end"
      }
    }
  }
}