{
  "ir_version": "4.0",
  "goal": "Scan Gmail Inbox for complaint emails from the last 7 days and append them to Google Sheets tab 'UrgentEmails', skipping duplicates based on Gmail message link/id",
  "execution_graph": {
    "start": "node_0",
    "nodes": {
      "node_0": {
        "id": "node_0",
        "type": "operation",
        "operation": {
          "operation_type": "fetch",
          "fetch": {
            "plugin_key": "google-mail",
            "action": "search_emails",
            "config": {
              "folder": "{{config.gmail_scope}}"
            }
          },
          "description": "Search Gmail Inbox for messages from the last 7 days"
        },
        "outputs": [
          {
            "variable": "gmail_messages"
          }
        ],
        "next": "node_1"
      },
      "node_1": {
        "id": "node_1",
        "type": "operation",
        "operation": {
          "operation_type": "fetch",
          "fetch": {
            "plugin_key": "google-sheets",
            "action": "read_range",
            "config": {
              "spreadsheet_id": "{{config.spreadsheet_id}}"
            }
          },
          "description": "Load existing rows from UrgentEmails tab to identify duplicates"
        },
        "outputs": [
          {
            "variable": "existing_rows"
          }
        ],
        "next": "node_2"
      },
      "node_2": {
        "id": "node_2",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "map",
            "input": "existing_rows",
            "custom_code": "Extract the Gmail message link/id field from each existing row to build deduplication set",
            "output_schema": {
              "type": "array",
              "items": {
                "type": "object",
                "properties": {
                  "message_id": {
                    "type": "string"
                  }
                },
                "required": [
                  "message_id"
                ]
              }
            }
          },
          "description": "Extract Gmail message link/id values from existing sheet rows"
        },
        "outputs": [
          {
            "variable": "existing_message_ids"
          }
        ],
        "next": "node_3"
      },
      "node_3": {
        "id": "node_3",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "filter",
            "input": "gmail_messages",
            "custom_code": "Keep only emails where content contains any of the complaint keywords (case-insensitive)",
            "condition": {
              "type": "complex",
              "operator": "or",
              "conditions": [
                {
                  "type": "simple",
                  "variable": "item.body",
                  "operator": "contains",
                  "value": "complaint"
                },
                {
                  "type": "simple",
                  "variable": "item.body",
                  "operator": "contains",
                  "value": "refund"
                },
                {
                  "type": "simple",
                  "variable": "item.body",
                  "operator": "contains",
                  "value": "angry"
                },
                {
                  "type": "simple",
                  "variable": "item.body",
                  "operator": "contains",
                  "value": "not working"
                }
              ]
            }
          },
          "description": "Filter emails containing complaint keywords (complaint, refund, angry, not working)"
        },
        "outputs": [
          {
            "variable": "complaint_emails"
          }
        ],
        "next": "node_4"
      },
      "node_4": {
        "id": "node_4",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "filter",
            "input": "complaint_emails",
            "custom_code": "Keep only complaint emails whose Gmail message link/id is not already present in the existing sheet rows"
          },
          "description": "Remove complaint emails that already exist in the sheet (deduplication by Gmail message link/id)"
        },
        "outputs": [
          {
            "variable": "new_complaint_emails"
          }
        ],
        "next": "node_5"
      },
      "node_6": {
        "id": "node_6",
        "type": "operation",
        "operation": {
          "operation_type": "transform",
          "transform": {
            "type": "map",
            "input": "complaint_email",
            "custom_code": "Extract sender email, subject, date, full email text, and Gmail message link/id",
            "output_schema": {
              "type": "object",
              "properties": {
                "sender_email": {
                  "type": "string"
                },
                "subject": {
                  "type": "string"
                },
                "date": {
                  "type": "string"
                },
                "body": {
                  "type": "string"
                },
                "message_id": {
                  "type": "string"
                }
              },
              "required": [
                "sender_email",
                "subject",
                "date",
                "body",
                "message_id"
              ]
            }
          },
          "description": "Extract required fields from complaint email"
        },
        "outputs": [
          {
            "variable": "email_row_data"
          }
        ],
        "next": "node_7"
      },
      "node_7": {
        "id": "node_7",
        "type": "operation",
        "operation": {
          "operation_type": "deliver",
          "deliver": {
            "plugin_key": "google-sheets",
            "action": "append_rows",
            "config": {
              "spreadsheet_id": "{{config.spreadsheet_id}}",
              "fields": {
                "sender_email": "email_row_data.sender_email",
                "subject": "email_row_data.subject",
                "date": "email_row_data.date",
                "full_email_text": "email_row_data.body",
                "gmail_message_link_id": "email_row_data.message_id"
              }
            }
          },
          "description": "Append complaint email row to UrgentEmails tab"
        },
        "outputs": [
          {
            "variable": "appended_row"
          }
        ]
      },
      "node_5": {
        "id": "node_5",
        "type": "loop",
        "loop": {
          "iterate_over": "new_complaint_emails",
          "item_variable": "complaint_email",
          "body_start": "node_6",
          "collect_outputs": false
        },
        "next": "node_end"
      },
      "node_end": {
        "id": "node_end",
        "type": "end"
      }
    }
  }
}